wpirri/pic32mmBoot/Programa/main.c
#define READ_RETRY 100

typedef struct
{
    UINT8 *start;
    UINT8 len;
    UINT8 status;
}T_REC;

typedef struct 
{
	UINT8 RecDataLen;
	DWORD_VAL Address;
	UINT8 RecType;
	UINT8* Data;
	UINT8 CheckSum;	
	DWORD_VAL ExtSegAddress;
	DWORD_VAL ExtLinAddress;
}T_HEX_RECORD;	

/* ************************************************************************** */

FSFILE * g_boot_file;
unsigned int    g_led_count;

UINT8 g_ascii_buffer[80];
UINT8 g_hex_rec[100];

char* g_buffer[256];

void JumpToApp(void);
BOOL ValidAppPresent(void);
void EraseFlash(void);
int WriteHexRecord2Flash(UINT8* HexRecord);
int CheckHexRecord(UINT8* HexRecord);
void ConvertAsciiToHex(UINT8* asciiRec, UINT8* hexRec);
int readLine(void *ptr, size_t max_len, FSFILE *stream);
void BlinkLed(unsigned int period);
void Error( unsigned int err );
void Log(const char* msg);



/*****************************************************************************/
int main(void)
{
    volatile unsigned long before_run_delay_count;
    volatile UINT i;
    g_boot_file = NULL;
    long bytecount;
    int byteread;
    int readretry;
    int validHex = 0;

    INTCONbits.MVEC = 1;
    asm volatile("ei $0");

/* ************************************************************************** */
/*  Setting the Output Latch SFR(s) */
    LATA = 0x00000000;
    LATB = 0x00000000;
    LATC = 0x00000000;

/* ************************************************************************** */
/* Setting the GPIO Direction SFR(s) */
    TRISA = 0xFFFFFFFF;
    TRISB = 0xFFFFFFFF;
    TRISC = 0xFFFFFFFF;
    
/* ************************************************************************** */
/* Setting the Weak Pull Up and Weak Pull Down SFR(s) */
    CNPDA = 0x00000000;
    CNPDB = 0x00000000;
    CNPDC = 0x00000000;
    CNPUA = 0x00000000;
    CNPUB = 0x00000000;
    CNPUC = 0x00000000;

/* ************************************************************************** */
/* Setting the Open Drain SFR(s) */
    ODCA = 0x00000000;
    ODCB = 0x00000000;
    ODCC = 0x00000000;

/* ************************************************************************** */
/* Setting the Analog/Digital Configuration SFR(s) */
    ANSELA = 0x00000000;
    ANSELB = 0x00000000;

/* ************************************************************************** */
/* Mï¿½dulo CPP */
    CCP1CON1 = 0x00000000;    
    CCP2CON1 = 0x00000000;    
    CCP3CON1 = 0x00000000;    
    
/* ************************************************************************** */
/* Change notification */
    CNCONB = 0x00000000;

/* ************************************************************************** */
/* Set the PPS */
    // System Reg Unlock
    SYSKEY = 0x12345678; //write invalid key to force lock
    SYSKEY = 0xAA996655; //write Key1 to SYSKEY
    SYSKEY = 0x556699AA; //write Key2 to SYSKEY
    // unlock PPS
    RPCONbits.IOLOCK = 0;
    RPOR0bits.RP4R = 0x0004;    //RA3->UART2:U2TX
    RPINR9bits.U2RXR = 0x0000;    //RA2->NADA - ( 0x0003 RA2->UART2:U2RX )
    /* Agregado para mapeo de SPI */
    RPOR1bits.RP6R = 0x0008;        //RB0->SPI2:SDO2
    RPINR11bits.SDI2R = 0x0007;     //RB1->SPI2:SDI2
    RPOR0bits.RP3R = 0x0009;        //RA2->SPI2:SCK2OUT
    RPINR11bits.SCK2INR = 0x0003;   //RA2->SPI2:SCK2OUT
    /* Agregado para mapeo de SPI */
    // lock   PPS
    RPCONbits.IOLOCK = 1; 
    // System Reg Lock
    SYSKEY = 0x00000000; 
/* ************************************************************************** */
/* OSCILLATOR Init */
    // System Reg Unlock
    SYSKEY = 0x12345678; //write invalid key to force lock
    SYSKEY = 0xAA996655; //write Key1 to SYSKEY
    SYSKEY = 0x556699AA; //write Key2 to SYSKEY
    // CF No Clock Failure; FRCDIV FRC/1; SLPEN Device will enter Idle mode when a WAIT instruction is issued; NOSC SPLL; SOSCEN disabled; CLKLOCK Clock and PLL selections are not locked and may be modified; OSWEN Complete; 
    OSCCON = 0x100;
    // TUN Center frequency; 
    OSCTUN = 0x0;
    // PLLODIV 1:1; PLLMULT 3x; PLLICLK FRC; 
    SPLLCON = 0x10080;
    // SWRST disabled; 
    RSWRST = 0x0;
    // WDTO disabled; GNMI disabled; CF disabled; WDTS disabled; NMICNT 0; LVD disabled; SWNMI disabled; 
    RNMICON = 0x0;
    // SBOREN disabled; VREGS disabled; RETEN disabled; 
    PWRCON = 0x0;
    // System Reg Lock
    SYSKEY = 0x00000000; 
    // WDTO disabled; EXTR disabled; POR disabled; SLEEP disabled; BOR disabled; PORIO disabled; IDLE disabled; PORCORE disabled; BCFGERR disabled; CMR disabled; BCFGFAIL disabled; SWR disabled; 
    RCON = 0x0;
    // ON disabled; DIVSWEN disabled; RSLP disabled; ROSEL SYSCLK; OE disabled; SIDL disabled; RODIV 0; 
    REFO1CON = 0x0;
    // ROTRIM 0; 
    REFO1TRIM = 0x0;
    // SPDIVRDY disabled; 
    CLKSTAT = 0x0;
/* ************************************************************************** */
/* Init RTCC */
    // System Reg Unlock
    SYSKEY = 0x12345678; //write invalid key to force lock
    SYSKEY = 0xAA996655; //write Key1 to SYSKEY
    SYSKEY = 0x556699AA; //write Key2 to SYSKEY

    RTCCON1CLR = (1 << _RTCCON1_WRLOCK_POSITION);
    RTCCON1CLR = (1 << _RTCCON1_ON_POSITION);
    // set 2024-01-01 00-00-00
    RTCDATE = 0x24010101; // Year/Month/Date/Wday
    RTCTIME = 0x000000; //  hours/minutes/seconds
    // ON enabled; OUTSEL Alarm Event; WRLOCK disabled; AMASK Every Half Second; ALMRPT 0; RTCOE disabled; CHIME disabled; ALRMEN disabled; 
    RTCCON1 = 0x8000;
    // DIV 15999; CLKSEL LPRC; FDIV 0; 
    RTCCON2 = 0x3E7F0001;
    // Enable RTCC 
    RTCCON1SET = (1 << _RTCCON1_ON_POSITION);
    RTCCON1SET = (1 << _RTCCON1_WRLOCK_POSITION);
/* ************************************************************************** */
/* UART2 */
   IEC1bits.U2TXIE = 0;
   IEC1bits.U2RXIE = 0;
   // STSEL 1; PDSEL 8N; RTSMD disabled; OVFDIS disabled; ACTIVE disabled; RXINV disabled; WAKE disabled; BRGH enabled; IREN disabled; ON enabled; SLPEN disabled; SIDL disabled; ABAUD disabled; LPBACK disabled; UEN TX_RX; CLKSEL PBCLK; 
   U2MODE = (0x8008 & ~(1<<15));  // disabling UART
   // UTXISEL TX_ONE_CHAR; UTXINV disabled; ADDR 0; MASK 0; URXEN disabled; OERR disabled; URXISEL RX_ONE_CHAR; UTXBRK disabled; UTXEN disabled; ADDEN disabled; 
   U2STA = 0x0;
   // BaudRate = 115200; Frequency = 24000000 Hz; BRG 51; 
   U2BRG = 0x33;
    //Make sure to set LAT bit corresponding to TxPin as high before UART initialization
   U2STASET = _U2STA_UTXEN_MASK;
   U2MODESET = _U2MODE_ON_MASK;  // enabling UART ON bit
   U2STASET = _U2STA_URXEN_MASK; 
/* ************************************************************************** */
    // System Reg Lock
    SYSKEY = 0x00000000; 
/* ************************************************************************** */
/* INTERRUPT Initialize */
    // Enable Multi Vector Configuration
    INTCONbits.MVEC = 1;
/* ************************************************************************** */

    
    TRISAbits.TRISA0 = 0;
    TRISAbits.TRISA1 = 0;
    TRISAbits.TRISA4 = 0;
    
    g_led_count = 0;

